       IDENTIFICATION DIVISION.
       PROGRAM-ID. LesOperations.
       AUTHOR. Alexandre ELISABETH.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NOMBRE1 PIC 9(3).
       01  NOMBRE2 PIC 9(3).
       01  NOMBRE3 PIC 9(3)V9999.
       01  RESULTAT PIC 9(3)V99.
       01  RESULTAT2 PIC 9(2)V9.


       PROCEDURE DIVISION.
           MOVE 5 TO NOMBRE1.
           MOVE 4 TO NOMBRE2.
           MOVE ZERO TO NOMBRE3.

           DISPLAY "ADD".

           ADD NOMBRE1 TO NOMBRE2 GIVING NOMBRE3.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           ADD NOMBRE2 TO NOMBRE3.
           ADD NOMBRE2 TO NOMBRE1.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           ADD 50 TO 60 GIVING NOMBRE1.
           ADD 75 TO 77 GIVING NOMBRE2 NOMBRE3.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           DISPLAY "SUBTRACT".

           SUBTRACT NOMBRE2 FROM NOMBRE3.
           SUBTRACT NOMBRE2 FROM NOMBRE1.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           MOVE 10 TO NOMBRE1.
           MOVE 15 TO NOMBRE2.
           MOVE 20 TO NOMBRE3.

           SUBTRACT NOMBRE1 NOMBRE2 FROM NOMBRE3.
           SUBTRACT NOMBRE3 NOMBRE1 FROM NOMBRE1 NOMBRE2.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           DISPLAY "MULTIPLY".

           MOVE 10 TO NOMBRE1.
           MOVE 15 TO NOMBRE2.
           MOVE 20 TO NOMBRE3.

           MULTIPLY NOMBRE1 BY NOMBRE2.
           MULTIPLY NOMBRE1 BY NOMBRE2 GIVING NOMBRE3.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           DISPLAY "DIVIDE".

           DIVIDE NOMBRE1 INTO NOMBRE2 GIVING NOMBRE3.

           DISPLAY NOMBRE3.

           DIVIDE NOMBRE1 BY NOMBRE2 GIVING NOMBRE3.

           DISPLAY NOMBRE3.

           MOVE 14 TO NOMBRE1.
           MOVE 153 TO NOMBRE2.
           MOVE 0 TO NOMBRE3.

           DIVIDE NOMBRE2 BY NOMBRE1 GIVING NOMBRE1 REMAINDER NOMBRE3.

           DISPLAY NOMBRE1.
           DISPLAY NOMBRE2.
           DISPLAY NOMBRE3.

           DISPLAY "COMPUTE"

           MOVE 10 TO NOMBRE1.
           MOVE 15 TO NOMBRE2.
           MOVE 4 TO NOMBRE3.

           COMPUTE RESULTAT = (NOMBRE1*NOMBRE2) + (100/NOMBRE3).

           DISPLAY RESULTAT.

           DISPLAY "COMPUTE ROUNDED"

           COMPUTE RESULTAT2 = 9.564 + 11.335.

           DISPLAY RESULTAT2.

           COMPUTE RESULTAT2 ROUNDED = 9.564 + 11.335.

           DISPLAY RESULTAT2.

           STOP RUN.
