       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Alexandre ELISABETH.

       PROCEDURE DIVISION.

           DISPLAY "Hello World !".

           STOP RUN.
